БылковДА_70180166/src/Documents/ИндивидуальныйПланЛиквидацииЗадолженностей/ИндивидуальныйПланЛиквидацииЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИндивидуальныйПланЛиквидацииЗадолженностей</name>
  <basedOn>Document.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности</basedOn>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаКонтроля</name>
    <type>
      <types>EnumRef.НаименованиеКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересдачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <type>
      <types>DocumentRef.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности</types>
    </type>
  </attributes>
</mdclass:Document>

БылковДА_70180166/src/Documents/ИндивидуальныйПланЛиквидацииЗадолженностей/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ИндивидуальныйПланЛиквидацииЗадолженностей.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.Группа,
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.Дата,
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.ДатаПересдачи,
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.Дисциплина,
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.Номер,
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.Преподаватель,
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.Причина,
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.Студент,
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.ФормаКонтроля
	|ИЗ
	|	Документ.ИндивидуальныйПланЛиквидацииЗадолженностей КАК ИндивидуальныйПланЛиквидацииЗадолженностей
	|ГДЕ
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
